Tekla Open API Reference for Tekla Structures 2025
UserDefinedElement Constructor
Overload List
Name | Description
UserDefinedElement(String)
 Creates a new user-defined element instance with the given name.
UserDefinedElement(String, FontAttributes)
 Creates a new user-defined element instance with the given name and font.
Top
See Also
Reference
UserDefinedElement Class
Tekla.Structures.Drawing Namespace